# JoistSystemClearSpacingParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..JoistSystemClearSpacingParam Property
ParameterTypeId Class See Also
---
"Clear Spacing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId JoistSystemClearSpacingParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JoistSystemClearSpacingParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ JoistSystemClearSpacingParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace